Repository: SwampRabbit/gnonograms
Catalog: po/extra/*.po
Languages: pt

source: Create and solve nonogram puzzles.
pt: Crie e resolva puzzles de monograma.

source: game;puzzle;logic;nonograms;Tsunami;Picross;Griddlers;Japanese Crossword;
pt: jogo;puzzle;lógica;monograma;Tsunami;Picross;Griddlers;Japonês;palavras;cruzadas;

source: Logic Game
pt: Jogo de Lógica

source: About Gnonograms
pt: Sobre o Gnonograms

source: Create and solve gnonogram puzzles
pt: Crie e resolva puzzles gnonogram

source: Draw puzzles
pt: Desenhe puzzles

source: Generate random puzzles of chosen difficulty
pt: Gere puzzles aleatórios com a dificuldade escolhida

source: Prepare for Juno
pt: Preparar para o Juno

source: Use Houston CI for testing
pt: Usar o Houston CI para testes

source: Use separate packaging branch
pt: Uso separado do pacote de ramificação

source: Add content rating tags
pt: Adicionadas etiquetas de classificação de conteúdo

source: Use scrolled window when grid larger than screen
pt: Uso de janela percorrida quando a vista de gralhe for superior ao ecrã

source: Fix some bugs with clue label formating
pt: Corrigido alguns erros com a formatação do rótulo das pistas

source: Toast has own copy of message to avoid possible crash
pt: O Toast tem um cópia própria da mensagem para prevenir uma possível falha

source: Conditional compilation with Gtk version &gt;=3.22
pt: Compilação condicional com a versão do Gtk &gt;=3.22

source: Some code refactoring and cleanup
pt: Alguma reestruturação e limpeza do código

source: Various small bug fixes
pt: Várias correções de erros

source: Fix crash when dragging across grid edge
pt: Correção de uma falha ao arrastar pela borda da grade

source: Clear puzzle name when resized
pt: Nome do puzzle claro mesmo ao redimensionar

source: Hint button
pt: Botão de dica

source: Strikethrough completed blocks in clue label (with option to disable)
pt: Blocos completos rasurados no rótulo de pista (com opção para desativar)

source: Clue label turns red if completed incorrectly (with option to disable)
pt: Rótulo de pista altera para vermelho se completado incorretamente (com opção para desativar)

source: Additional shortcuts
pt: Atalhos adicionais

source: Various bug fixes
pt: Várias correções

source: Save and restore move history
pt: Gravar e restaurar a história de movimentos

source: Fade completed clues when solving
pt: Desvanecer pistas completas ao resolver

source: Generate difficult puzzles faster
pt: Gerar puzzles difíceis mais rapidamente

source: Add redo button
pt: Botão refazer adicionado

source: Reorder header bar
pt: Barra do cabeçalho reordenada

source: Some restyling
pt: Alterações de estilo

source: Add brand styling and update screenshots
pt: Estilo de marca adicionado e atualização de captura de ecrãs

source: Fix possible failed assertion in advanced solver
pt: Correção de possível afirmação com falha no solucionador avançado

source: Fix some resizing isses
pt: Correção de alguns problemas com o redimensionar

source: Fix some loading and saving issues
pt: Correção de alguns problemas ao carregar e gravar

source: Fix regression in game generator
pt: Correção de uma regressão no gerador do jogo

source: Fix error in solver
pt: Correção de um erro no solucionador

source: Fix post_install.py script
pt: Correção da escrita post_install.py

source: Remove unused or deprecated config variables
pt: Removidas configuração de variáveis não usadas ou descontinuadas

source: Replace deprecated Gtk.Stock items
pt: Itens Gtk.Stock descontinuados removidos

source: Fix first run after clean install problems
pt: Correção da abertura inicial da aplicação

source: More complete uninstall
pt: Desinstalação mais completa

source: Provide mimeinfo and icon
pt: Proporcionar mimeinfo e ícone

source: Fix debian files
pt: Correção de ficheiros debian

source: Fix .desktop file
pt: Ficheiro .desktop corrigido

source: Fix .appdata file
pt: Ficheiro .appdata corrigido

source: Builds with dpkg-buildpackage and Travis CI
pt: Construção do programa com dpkg-buildpackage e Travis CI

source: Correct dependencies for xenial build
pt: Dependências corretas para a construção xenial

source: Initial release.
pt: Lançamento inicial.

source: Generate random puzzles
pt: Gerar puzzles aleatórios

source: Check for errors while solving
pt: Verificar erros ao resolver

source: Adjust size of grid
pt: Ajustar o tamanho da grelha

source: Adjust difficulty of generated puzzles
pt: Ajustar a dificuldade dos puzzles gerados

source: Save and restore program state and settings
pt: Gravar e restaurar o estado do programa e definições
