Repository: SwampRabbit/gnonograms
Catalog: po/*.po
Languages: nl, pt

source: Difficulty
nl: Moeilijkheidsgraad
pt: Dificuldade

source: Enter title of game here
nl: Voer hier de spelnaam in
pt: Insira o título do jogo aqui

source: Title
nl: Naam
pt: Título

source: Freedom = %u
nl: Vrijheid = %u
pt: Liberdade= %u

source: Open
nl: Openen
pt: Abrir

source: Save
nl: Opslaan
pt: Gravar

source: Apply
nl: Toepassen
pt: Aplicar

source: Cancel
nl: Annuleren
pt: Cancelar

source: Save solution too
nl: Oplossing ook opslaan
pt: Gravar também a solução

source: Overwrite %s
nl: %s overschrijven
pt: Substituir %s

source: This action will destroy contents of that file
nl: Hiermee vernietig je de inhoud van dat bestand
pt: Esta ação vai destruir os conteúdos desse ficheiro

source: Gnonogram puzzles
nl: Gnonogram-puzzels
pt: Puzzles Gnonogram

source: Choose a puzzle
nl: Kies een puzzel
pt: Escolha um puzzle

source: Missing clues
nl: Aanwijzingen ontbreken
pt: Ausência de pistas

source: Invalid clue
nl: Ongeldige aanwijzing
pt: Pista invalida

source: Solution grid or working grid missing
nl: Oplos- of werkrooster ontbreekt
pt: Grelha de solução ou grelha funcional em falta

source: Wrong number of rows in solution or working grid
nl: Onjuist aantal rijen in oplos- of werkrooster
pt: Número de linhas é inválido para a grelha de solução ou grelha funcional

source: Wrong number of columns in solution or working grid
nl: Onjuist aantal kolommen in oplos- of werkrooster
pt: Número de colunas é inválido para a grelha de solução ou grelha funcional

source: Invalid cell state
nl: Ongeldige celstatus
pt: Estado da célula invalido

source: Name and save this puzzle
nl: Geef de puzzel een naam en sla hem op
pt: Dê nome e grave este puzzle

source: Confirm save without solution
nl: Opslaan zonder oplossing bevestigen
pt: Confirmar gravar sem solução

source: Do not save computer insoluble clues without solution
nl: Sla geen computeraanwijzingen op zonder oplossing
pt: Não guarde pistas insolúveis de computador sem solução

source: Trivial
nl: Triviaal

source: Very Easy
nl: Erg makkelijk
pt: Muito Fácil

source: Easy
nl: Makkelijk
pt: Fácil

source: Moderately difficult
nl: Normaal
pt: Dificuldade Moderada

source: Difficult
nl: Moeilijk
pt: Difícil

source: Very Difficult
nl: Erg moeilijk
pt: Muito Difícil

source: Advanced logic required
nl: Hogere wiskunde vereist
pt: Lógica avançada necessária

source: Possibly ambiguous
nl: Mogelijk dubbelzinnig
pt: Possivelmente ambíguo

source: Super human
nl: Superheld
pt: Super Homem

source: Undefined
nl: Niet-opgegeven
pt: Indefinido

source: Untitled
nl: Naamloos
pt: Sem título

source: Random pattern
nl: Willekeurig patroon
pt: Padrão aleatório

source: Generating
nl: Bezig met samenstellen
pt: A gerar

source: Game generation was cancelled
nl: Samenstellen geannuleerd
pt: A geração do jogo foi cancelada

source: Failed to generate game of required grade
nl: Er kan geen spel op dit niveau worden samengesteld
pt: Falha ao gerar o jogo do grau pedido

source: Unable to save %s
nl: %s kan niet worden opgeslagen
pt: Incapaz de gravar %s

source: game
nl: spel
pt: jogo

source: Unable to load game. %s
nl: %s kan niet worden geladen.
pt: Incapaz de carregar jogo. %s

source: Dimensions too large
nl: Te grote afmetingen
pt: As dimensões são muito grandes

source: Dimensions too small
nl: Te kleine afmetingen
pt: As dimensões são muito pequenas

source: Dimensions missing
nl: Afmetingen ontbreken
pt: As dimensões estão em falta

source: Clues missing
nl: Aanwijzingen ontbreken
pt: Pistas em falta

source: %u error found
nl: %u fout aangetroffen
pt: %u erro encontrado

source: %u errors found
nl: %u fouten aangetroffen
pt: %u erros encontrados

source: Correct solution
nl: Juiste oplossing
pt: Solução correta

source: Alternative solution found
nl: Alternatieve oplossing gevonden
pt: Solução alternativa encontrada

source: There are errors
nl: Er zijn fouten
pt: Existem erros

source: Saved to %s
nl: Opslagen naar %s
pt: Gravado em %s

source: Failed to find a hint using simple logic - multi-line logic (trial and error) required
nl: Er kan geen aanwijzing worden gevonden met eenvoudige logica - logica met meerdere rijen (probeerhandelingen) vereist
pt: Falhou a procura de pistas usando a lógica simples - lógica de múltiplas linhas (tentativa e erro) é necessária

source: Solving
nl: Bezig met oplossen
pt: A resolver

source: Solving was cancelled
nl: Oplossen geannuleerd
pt: A resolução foi cancelada

source: Solution found. %s
nl: Oplossing gevonden. %s
pt: Solução encontrada. %s

source: No solution found
nl: Geen oplossing gevonden
pt: Nenhuma solução encontrada

source: Gnonograms for elementary
nl: Gnonograms voor elementary
pt: Gnonograms para o elementary

source: Load a Game from File
nl: Spel laden uit bestand
pt: Carregar um Jogo de um ficheiro

source: Save Game
nl: Spel opslaan
pt: Gravar Jogo

source: Save Game to Different File
nl: Spel opslaan naar ander bestand
pt: Gravar Jogo num Ficheiro Diferente

source: Undo Last Move
nl: Recentste zet ongedaan maken
pt: Desfazer Último Movimento

source: Redo Last Move
nl: Recentste zet opnieuw uitvoeren
pt: Refazer Último Movimento

source: Go Back to Last Correct Position
nl: Ga terug naar laatste juiste positie
pt: Ir Para Trás da Última Posição Correta

source: Suggest next move
nl: Volgende zet voorspellen
pt: Sugerir o movimento seguinte

source: Solve by Computer
nl: Computeroplossing
pt: Solucionar pelo Computador

source: Drawing %s
nl: Bezig met tekenen van %s
pt: A desenhar %s

source: Read Only - Save to a different file
nl: Alleen-lezen - sla op naar ander bestand
pt: Só Leitura - Grave num ficheiro diferente

source: Save will Overwrite
nl: Opslaan overschrijft
pt: O Gravar vai Substituir

source: Clear canvas
nl: Canvas leegmaken
pt: Limpar o canvas

source: Solving %s
nl: Bezig met oplossen van %s
pt: A resolver %s

source: Restart solving
nl: Opnieuw oplossen
pt: Reiniciar a resolução

source: No errors
nl: Geen fouten
pt: Sem erros

source: Rows
nl: Rijen
pt: Linhas

source: Columns
nl: Kolommen
pt: Colunas

source: Strike out complete blocks
nl: Doorhalen zorgt voor volledige blokkade
pt: Excluir blocos completos

source: Options
nl: Opties
pt: Opções

source: Generate %s puzzle
nl: %s puzzel samenstellen
pt: Gerar puzzle %s

source: Draw pattern
nl: Patroon tekenen
pt: Padrão de desenho

source: Solve puzzle
nl: Puzzel oplossen
pt: Resolver o puzzle

source: Generate new random puzzle
nl: Nieuwe willekeurige puzzel samenstellen
pt: Gerar um novo puzzle aleatoriamente

source: Cancel solving
nl: Oplossen annuleren
pt: Cancelar resolução
